from .. import loader
from asyncio import sleep 

def register(cb):
	cb(ZVAZDAsn()) 
	
class SENATORzv(loader.Module):
	"""ZVEZDAsn"""
	strings = {'name': 'ZvezdapadSN'}
        
	async def snowcmd(self, message):
		"""Используй .zv"""
		await message.edit('✨🌙✨✨✨✨✨✨✨✨✨\n\n\n\n\n\n🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉')
		await sleep(0.20)
		await message.edit('✨✨🌙✨✨✨✨✨✨✨✨\n    ✨    ✨      ✨    ✨     ✨   ✨\n\n\n\n\n🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉')
		await sleep(0.20)
		await message.edit('✨✨✨🌙✨✨✨✨✨✨✨\n    ✨    ✨     ✨     ✨     ✨   ✨\n✨    ✨    ✨    ✨    ✨    ✨\n\n\n\n\🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉')
		await sleep(0.20)
		await message.edit('✨✨✨✨🌙✨✨✨✨✨✨\n   ✨    ✨     ✨     ✨     ✨   ✨\n✨    ✨    ✨    ✨    ✨    ✨       \n    ✨    ✨    ✨    ✨    ✨    ✨\n\n\n\🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉')
		await sleep(0.20)
		await message.edit('✨✨✨✨✨🌙✨✨✨✨✨\n    ✨    ✨     ✨     ✨     ✨   ✨\n✨    ✨    ✨    ✨    ✨    ✨       \n    ✨    ✨    ✨    ✨    ✨    ✨     \n✨    ✨    ✨    ✨    ✨    ✨\n\n\🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉')
		await sleep(0.20)
		await message.edit('✨✨✨✨✨✨🌙✨✨✨✨\n    ✨    ✨     ✨     ✨     ✨   ✨\n✨    ✨    ✨    ✨    ✨    ✨       \n    ✨    ✨    ✨    ✨    ✨    ✨     \n✨    ✨    ✨    ✨    ✨    ✨     \n  ✨      ✨    ✨  ✨      ✨  ✨\n\🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉🌉') 
	
		
